<!doctype html>
<html class="no-js" lang="en">

<head>
  <!-- Global site tag (gtag.js) - Google Analytics -->
  <script async src="https://www.googletagmanager.com/gtag/js?id=UA-134228602-6"></script>
  <script>
    window.dataLayer = window.dataLayer || [];
    function gtag(){dataLayer.push(arguments);}
    gtag('js', new Date());

    gtag('config', 'UA-134228602-6');
  </script>

  <meta charset="utf-8">
  <meta http-equiv="x-ua-compatible" content="ie=edge">
  <title>🎬 🐌 🧑‍🤝‍🧑 密码查询语言简介 👩🏾‍🤝‍👨🏿 🎱 🚶🏾</title>
  <link rel="icon" type="image/x-icon" href="/favicon.ico" />
  <meta name="description" content="查询语言Cypher最初是专门为图形 DBMS Neo4j开发的 。 Cypher的目标是为图形数据库提供一种人类可读的SQL数据库查询语言。 如今，Cypher得到了几种图形DBMS的支持。 OpenCypher的创建是为了标准化Cypher。 


 在浏览器中使用Neo4j的基础知识文章中描述...">
  <meta name="viewport" content="width=device-width, initial-scale=1, shrink-to-fit=no">

  <link rel="stylesheet" href="../../css/main.css">

  <link href="https://fonts.googleapis.com/css?family=Quicksand&display=swap" rel="stylesheet">

  <script src="https://cdnjs.cloudflare.com/ajax/libs/jquery/3.3.1/jquery.min.js"></script>
  <script>window.jQuery || document.write('<script src="../../js/vendors/jquery-3.3.1.min.js"><\/script>')</script>

  <script>document.write('<script src="//pagea' + 'd2.googles' + 'yndication.com/pagea' + 'd/js/a' + 'dsby' + 'google.js"><\/script>')</script>
  <script>
        var superSpecialObject = {};
        superSpecialObject['google_a' + 'd_client'] = 'ca-p' + 'ub-6974184241884155';
        superSpecialObject['enable_page_level_a' + 'ds'] = true;
       (window['a' + 'dsbygoogle'] = window['a' + 'dsbygoogle'] || []).push(superSpecialObject);
  </script>
</head>

<body>
  <!--[if lte IE 9]>
    <p class="browserupgrade">You are using an <strong>outdated</strong> browser. Please <a href="https://browsehappy.com/">upgrade your browser</a> to improve your experience and security.</p>
  <![endif]-->
  <header class="page-header js-page-header">
    <a class="page-header-logo-container" href="https://weekly-geekly-es.github.io/index.html"></a>
    <div class="page-header-text">Geekly articles weekly</div>
  </header>
  <section class="page js-page"><h1>密码查询语言简介</h1><div class="post__body post__body_full"><div class="post__text post__text-html" id="post-content-body" data-io-article-url="https://habr.com/ru/post/482418/"><p> 查询语言<em>Cypher</em>最初是专门为<a href="https://neo4j.com/" rel="nofollow">图形</a> DBMS <a href="https://neo4j.com/" rel="nofollow">Neo4j开发的</a> 。  Cypher的目标是为图形数据库提供一种人类可读的SQL数据库查询语言。 如今，Cypher得到了几种图形DBMS的支持。  <a href="http://www.opencypher.org/" rel="nofollow">OpenCypher的</a>创建是为了标准化Cypher。 </p><br><p>  <a href="https://habr.com/ru/post/470541/">在浏览器中使用Neo4j的基础知识</a>文章中描述了使用Neo4j DBMS的<a href="https://habr.com/ru/post/470541/">基础知识</a> 。 </p><br><p> 为了使自己熟悉Cypher，请考虑一本从I. Bratko的经典Prolog教科书中借来的家谱的例子。 此示例将说明如何向图添加节点和链接，如何为它们分配标签和属性以及如何提出问题。 </p><br><p><img src="https://habrastorage.org/webt/ix/__/op/ix__op6ei5llgpwdtzrnpcv5xd4.png" alt="Neo4j中的家谱，已编辑视图"></p><a name="habracut"></a><br><p> 因此，让我们在下图中显示一棵家谱。 </p><br><p><img src="https://habrastorage.org/webt/zy/zf/v4/zyzfv4aasw-sokctup7s3vq4csi.png" alt="家谱"></p><br><p> 让我们看看如何在Cypher中形成相应的图形： </p><br><pre><code class="plaintext hljs">CREATE (pam:Person {name: "Pam"}), (tom:Person {name: "Tom"}), (kate:Person {name: "Kate"}), (mary:Person {name: "Mary"}), (bob:Person {name: "Bob"}), (liz:Person {name: "Liz"}), (dick:Person {name: "Dick"}), (ann:Person {name: "Ann"}), (pat:Person {name: "Pat"}), (jack:Person {name: "Jack"}), (jim:Person {name: "Jim"}), (joli:Person {name: "Joli"}), (pam)-[:PARENT]-&gt;(bob), (tom)-[:PARENT]-&gt;(bob), (tom)-[:PARENT]-&gt;(liz), (kate)-[:PARENT]-&gt;(liz), (mary)-[:PARENT]-&gt;(ann), (bob)-[:PARENT]-&gt;(ann), (bob)-[:PARENT]-&gt;(pat), (dick)-[:PARENT]-&gt;(jim), (ann)-[:PARENT]-&gt;(jim), (pat)-[:PARENT]-&gt;(joli), (jack)-[:PARENT]-&gt;(joli)</code> </pre> <br><p> 将数据添加到图形DBMS的CREATE请求由两部分组成：添加节点以及在它们之间添加链接。 在此请求的框架内，将为每个要添加的节点分配一个名称，然后将其用于创建链接。 节点和通信可以存储文档。 在我们的例子中，节点包含带有名称字段的文档，而文档链接不包含。 还可以标记节点和链接。 在我们的例子中，节点被分配标签为Person，链接为PARENT。 请求中的标签在名称前用冒号突出显示。 </p><br><p> 因此，Neo4j告诉我们： <code>Added 12 labels, created 12 nodes, set 12 properties, created 11 relationships, completed after 9 ms.</code> </p><br><p> 让我们看看我们得到了什么： </p><br><pre> <code class="plaintext hljs">MATCH (p:Person) RETURN p</code> </pre> <br><p><img src="https://habrastorage.org/webt/ch/gc/ya/chgcyawfcxryshb6p1xdjtf7fp8.png" alt="Neo4j中的家谱"></p><br><p> 没有人禁止我们编辑结果图的外观： </p><br><p><img src="https://habrastorage.org/webt/ix/__/op/ix__op6ei5llgpwdtzrnpcv5xd4.png" alt="Neo4j中的家谱，已编辑视图"></p><br><p> 该怎么办？ 您可以验证，例如，Pam是 <br> 鲍勃的父母： </p><br><pre> <code class="plaintext hljs">MATCH ans = (:Person {name: "Pam"})-[:PARENT]-&gt;(:Person {name: "Bob"}) RETURN ans</code> </pre> <br><p> 我们得到相应的子图： </p><br><p><img src="https://habrastorage.org/webt/dj/jq/o_/djjqo_tukevpbd1viu8smouuume.png" alt="帕姆是鲍勃的父母"></p><br><p> 但是，这并不是我们真正需要的。 更改请求： </p><br><pre> <code class="plaintext hljs">MATCH ans = (:Person {name: "Pam"})-[:PARENT]-&gt;(:Person {name: "Bob"}) RETURN ans IS NOT NULL</code> </pre> <br><p> 现在，我们得到了回应。 如果我们问： </p><br><pre> <code class="plaintext hljs">MATCH ans = (:Person {name: "Pam"})-[:PARENT]-&gt;(:Person {name: "Liz"}) RETURN ans IS NOT NULL</code> </pre> <br><p> 我们什么都不会得到。。。在这里您需要添加单词<code>OPTIONAL</code> ，然后如果 <br> 结果为空，然后返回<code>false</code> ： </p><br><pre> <code class="plaintext hljs">OPTIONAL MATCH ans = (:Person {name: "Pam"})-[:PARENT]-&gt;(:Person {name: "Liz"}) RETURN ans IS NOT NULL</code> </pre> <br><p> 现在我们得到预期的答案为<code>false</code> 。 </p><br><p> 接下来，您可以看到谁是谁的父母： </p><br><pre> <code class="plaintext hljs">MATCH (p1:Person)-[:PARENT]-&gt;(p2:Person) RETURN p1, p2</code> </pre> <br><p> 使用“ <code>Text</code>打开结果选项卡，然后查看包含两列的表： </p><br><pre> <code class="plaintext hljs">╒═══════════════╤═══════════════╕ │"p1" │"p2" │ ╞═══════════════╪═══════════════╡ │{"name":"Pam"} │{"name":"Bob"} │ ├───────────────┼───────────────┤ │{"name":"Tom"} │{"name":"Bob"} │ ├───────────────┼───────────────┤ │{"name":"Tom"} │{"name":"Liz"} │ ├───────────────┼───────────────┤ │{"name":"Kate"}│{"name":"Liz"} │ ├───────────────┼───────────────┤ │{"name":"Mary"}│{"name":"Ann"} │ ├───────────────┼───────────────┤ │{"name":"Bob"} │{"name":"Ann"} │ ├───────────────┼───────────────┤ │{"name":"Bob"} │{"name":"Pat"} │ ├───────────────┼───────────────┤ │{"name":"Dick"}│{"name":"Jim"} │ ├───────────────┼───────────────┤ │{"name":"Ann"} │{"name":"Jim"} │ ├───────────────┼───────────────┤ │{"name":"Pat"} │{"name":"Joli"}│ ├───────────────┼───────────────┤ │{"name":"Jack"}│{"name":"Joli"}│ └───────────────┴───────────────┘</code> </pre> <br><p> 我们还能学到什么？ 例如，谁是属的特定成员的父母，例如Bob： </p><br><pre> <code class="plaintext hljs">MATCH (parent:Person)-[:PARENT]-&gt;(:Person {name: "Bob"}) RETURN parent.name</code> </pre> <br><pre> <code class="plaintext hljs">╒═════════════╕ │"parent.name"│ ╞═════════════╡ │"Tom" │ ├─────────────┤ │"Pam" │ └─────────────┘</code> </pre> <br><p> 在这里，作为答案，我们不请求整个节点，而仅请求其特定属性。 </p><br><p> 我们还可以找出鲍勃的孩子是谁： </p><br><pre> <code class="plaintext hljs">MATCH (:Person {name: "Bob"})-[:PARENT]-&gt;(child:Person) RETURN child.name</code> </pre> <br><pre> <code class="plaintext hljs">╒════════════╕ │"child.name"│ ╞════════════╡ │"Ann" │ ├────────────┤ │"Pat" │ └────────────┘</code> </pre> <br><p> 我们也可以问谁有孩子： </p><br><pre> <code class="plaintext hljs">MATCH (parent:Person)-[:PARENT]-&gt;(:Person) RETURN parent.name</code> </pre> <br><pre> <code class="plaintext hljs">╒═════════════╕ │"parent.name"│ ╞═════════════╡ │"Pam" │ ├─────────────┤ │"Tom" │ ├─────────────┤ │"Tom" │ ├─────────────┤ │"Kate" │ ├─────────────┤ │"Mary" │ ├─────────────┤ │"Bob" │ ├─────────────┤ │"Bob" │ ├─────────────┤ │"Dick" │ ├─────────────┤ │"Ann" │ ├─────────────┤ │"Pat" │ ├─────────────┤ │"Jack" │ └─────────────┘</code> </pre> <br><p> 嗯，汤姆和鲍勃相遇了两次，解决了这个问题： </p><br><pre> <code class="plaintext hljs">MATCH (parent:Person)-[:PARENT]-&gt;(:Person) RETURN DISTINCT parent.name</code> </pre> <br><p> 我们在查询的返回结果中添加了单词<code>DISTINCT</code> ，这意味着 <br> 与SQL中的类似。 </p><br><pre> <code class="plaintext hljs">╒═════════════╕ │"parent.name"│ ╞═════════════╡ │"Pam" │ ├─────────────┤ │"Tom" │ ├─────────────┤ │"Kate" │ ├─────────────┤ │"Mary" │ ├─────────────┤ │"Bob" │ ├─────────────┤ │"Dick" │ ├─────────────┤ │"Ann" │ ├─────────────┤ │"Pat" │ ├─────────────┤ │"Jack" │ └─────────────┘</code> </pre> <br><p> 您可能还会注意到Neo4j按照在<code>CREATE</code>请求中输入的顺序将父母退还给我们。 </p><br><p> 现在让我们问谁是祖父或祖母： </p><br><pre> <code class="plaintext hljs">MATCH (grandparent:Person)-[:PARENT]-&gt;()-[:PARENT]-&gt;(:Person) RETURN DISTINCT grandparent.name</code> </pre> <br><p> 太好了，就是这样： </p><br><pre> <code class="plaintext hljs">╒══════════════════╕ │"grandparent.name"│ ╞══════════════════╡ │"Tom" │ ├──────────────────┤ │"Pam" │ ├──────────────────┤ │"Bob" │ ├──────────────────┤ │"Mary" │ └──────────────────┘</code> </pre> <br><p> 在查询模板中，我们使用了一个中间的无名节点<code>()</code>和两个类型为<code>PARENT</code>关系。 </p><br><p> 现在我们找出谁是父亲。 父亲是一个有孩子的男人。 因此，我们缺乏有关该男子是谁的数据。 因此，要确定谁是母亲，您需要知道谁是女人。 将相关信息添加到我们的数据库中。 为此，我们将标签<code>Male</code>和<code>Female</code>分配给现有节点。 </p><br><pre> <code class="plaintext hljs">MATCH (p:Person) WHERE p.name IN ["Tom", "Dick", "Bob", "Jim", "Jack"] SET p:Male</code> </pre> <br><pre> <code class="plaintext hljs">MATCH (p:Person) WHERE p.name IN ["Pam", "Kate", "Mary", "Liz", "Ann", "Pat", "Joli"] SET p:Female</code> </pre> <br><p> 让我们解释一下我们在这里所做的事情：我们选择了所有标有<code>Person</code>节点，并选中了它们 <br> 根据在方括号中指定的给定列表指定<code>name</code>属性，并分别为相应的节点分配标签<code>Male</code>或<code>Female</code> 。 </p><br><p> 检查： </p><br><pre> <code class="plaintext hljs">MATCH (p:Person) WHERE p:Male RETURN p.name</code> </pre> <br><pre> <code class="plaintext hljs">╒════════╕ │"p.name"│ ╞════════╡ │"Tom" │ ├────────┤ │"Bob" │ ├────────┤ │"Dick" │ ├────────┤ │"Jack" │ ├────────┤ │"Jim" │ └────────┘</code> </pre> <br><pre> <code class="plaintext hljs">MATCH (p:Person) WHERE p:Female RETURN p.name</code> </pre> <br><pre> <code class="plaintext hljs">╒════════╕ │"p.name"│ ╞════════╡ │"Pam" │ ├────────┤ │"Kate" │ ├────────┤ │"Mary" │ ├────────┤ │"Liz" │ ├────────┤ │"Ann" │ ├────────┤ │"Pat" │ ├────────┤ │"Joli" │ └────────┘</code> </pre> <br><p> 我们请求所有标记为<code>Person</code>节点，每个节点也分别标记为<code>Male</code>或<code>Female</code> 。 但是我们可以使我们的请求有所不同： </p><br><pre> <code class="plaintext hljs">MATCH (p:Person:Male) RETURN p.name MATCH (p:Person:Female) RETURN p.name</code> </pre> <br><p> 让我们再次看一下我们的图： </p><br><p><img src="https://habrastorage.org/webt/zc/nn/pj/zcnnpj6ynprgddwmbdhoh3ubjp8.png" alt="带有标签男性和女性的家谱"></p><br><p>  Neo4j Browser根据Male和Mark的标记以两种不同的颜色绘制节点 <br> 女款 </p><br><p> 好的，现在我们可以从数据库中查询所有父亲： </p><br><pre> <code class="plaintext hljs">MATCH (p:Person:Male)-[:PARENT]-&gt;(:Person) RETURN DISTINCT p.name</code> </pre> <br><pre> <code class="plaintext hljs">╒════════╕ │"p.name"│ ╞════════╡ │"Tom" │ ├────────┤ │"Bob" │ ├────────┤ │"Dick" │ ├────────┤ │"Jack" │ └────────┘</code> </pre> <br><p> 和母亲： </p><br><pre> <code class="plaintext hljs">MATCH (p:Person:Female)-[:PARENT]-&gt;(:Person) RETURN DISTINCT p.name</code> </pre> <br><pre> <code class="plaintext hljs">╒════════╕ │"p.name"│ ╞════════╡ │"Pam" │ ├────────┤ │"Kate" │ ├────────┤ │"Mary" │ ├────────┤ │"Ann" │ ├────────┤ │"Pat" │ └────────┘</code> </pre> <br><p> 现在让我们建立一个兄弟姐妹关系。  X是Y的兄弟， <br> 如果他是男人，并且对于X和Y，至少有一个共同的父母。 同样的 <br> 关系姐姐。 </p><br><p> 兄弟对密码的态度： </p><br><pre> <code class="plaintext hljs">MATCH (brother:Person:Male)&lt;-[:PARENT]-()-[:PARENT]-&gt;(p:Person) RETURN brother.name, p.name</code> </pre> <br><pre> <code class="plaintext hljs">╒══════════════╤════════╕ │"brother.name"│"p.name"│ ╞══════════════╪════════╡ │"Bob" │"Liz" │ └──────────────┴────────┘</code> </pre> <br><p>  Cypher的姐妹态度： </p><br><pre> <code class="plaintext hljs">MATCH (sister:Person:Female)&lt;-[:PARENT]-()-[:PARENT]-&gt;(p:Person) RETURN sister.name, p.name</code> </pre> <br><pre> <code class="plaintext hljs">╒═════════════╤════════╕ │"sister.name"│"p.name"│ ╞═════════════╪════════╡ │"Liz" │"Bob" │ ├─────────────┼────────┤ │"Ann" │"Pat" │ ├─────────────┼────────┤ │"Pat" │"Ann" │ └─────────────┴────────┘</code> </pre> <br><p> 因此，我们可以找出谁是谁的父母，以及谁是谁的祖父或祖母。 但是，更远的祖先呢？ 有曾祖父，曾曾祖父等等？ 我们不会为每种情况编写相应的规则，并且每次都会有更多问题。 实际上，一切都很简单：如果X是父Y的祖先，则X是Y的祖先。Cypher提供了一个模式<code>*</code> ，允许您要求一个任意长度的关系序列： </p><br><pre> <code class="plaintext hljs">MATCH (p:Person)-[*]-&gt;(s:Person) RETURN DISTINCT p.name, s.name</code> </pre> <br><p> 确实存在一个问题：将是任何连接。 添加对<code>PARENT</code>链接的引用： </p><br><pre> <code class="plaintext hljs">MATCH (p:Person)-[:PARENT*]-&gt;(s:Person) RETURN DISTINCT p.name, s.name</code> </pre> <br><p> 为了不增加文章的篇幅，我们找到了<code>Joli</code>所有祖先： </p><br><pre> <code class="plaintext hljs">MATCH (p:Person)-[:PARENT*]-&gt;(:Person {name: "Joli"}) RETURN DISTINCT p.name</code> </pre> <br><pre> <code class="plaintext hljs">╒════════╕ │"p.name"│ ╞════════╡ │"Jack" │ ├────────┤ │"Pat" │ ├────────┤ │"Bob" │ ├────────┤ │"Pam" │ ├────────┤ │"Tom" │ └────────┘</code> </pre> <br><p> 考虑一个更复杂的规则，以找出与谁相关的人。 <br> 首先，亲戚是祖先和后代，例如儿子和母亲，祖母和孙子。 其次，亲戚是兄弟姐妹，包括堂兄弟姐妹，第二堂兄弟姐妹等等，就祖先而言，这意味着他们拥有共同的祖先。 第三，具有共同后代的亲戚，例如丈夫和妻子，被视为亲戚。 </p><br><p> 在Cypher上，您需要对多种模式使用<code>UNION</code> ： </p><br><pre> <code class="plaintext hljs">MATCH (r1:Person)-[:PARENT*]-(r2:Person) RETURN DISTINCT r1.name, r2.name UNION MATCH (r1:Person)&lt;-[:PARENT*]-(:Person)-[:PARENT*]-&gt;(r2:Person) RETURN DISTINCT r1.name, r2.name UNION MATCH (r1:Person)-[:PARENT*]-&gt;(:Person)&lt;-[:PARENT*]-(r2:Person) RETURN DISTINCT r1.name, r2.name</code> </pre> <br><p> 在这里，第一条规则是使用连接，连接的方向对我们而言无关紧要。 这样的连接用箭头表示，而不是短划线<code>-</code> 。 第二和第三条规则以显而易见的熟悉方式编写。 </p><br><p> 我们不会在这里显示总查询的结果，我们只会说找到的亲戚对是132，这与计算值一致，即从12开始的有序对的数量。我们也可以通过将变量<code>r1</code>或<code>r2</code>的出现替换为<code>(:Person {name: "Liz"})</code> ，但是，在我们的案例中，这没有多大意义，因为数据库中的所有人显然都是亲戚。 </p><br><p> 到此，我们结束了在数据库中识别人与人之间关系的讨论。 </p><br><p> 最后，考虑如何删除节点和链接。 </p><br><p> 要删除我们所有人，您可以执行以下请求： </p><br><pre> <code class="plaintext hljs">MATCH (p:Person) DELETE p</code> </pre> <br><p> 但是，Neo4j将告诉我们您不能删除具有链接的节点。 <br> 因此，我们首先删除链接，然后重复删除节点： </p><br><pre> <code class="plaintext hljs">MATCH (p1:Person)-[r]-&gt;(p2:Person) DELETE r</code> </pre> <br><p> 现在我们要做的事情：比较两个有连接的人，将此连接命名为<code>r</code> ，然后将其删除。 </p><br><h2 id="zaklyuchenie"> 结论 </h2><br><p> 本文通过一个简单的社交图示例显示了如何使用Cypher查询语言的功能。 特别是，我们研究了如何通过一个查询添加节点和链接，如何搜索相关数据（包括间接链接）以及如何为节点分配标签。 有关Cypher的更多信息，请参见下面的链接。 一个很好的起点是“ Neo4j Cypher Refcard”。 </p><br><p>  Neo4j远非唯一的图形DBMS。 在其他最受欢迎的软件中，包括<a href="https://www.cayley.io/" rel="nofollow">Cayley</a> ，具有GraphQL查询语言的Dgraph，多模型<a href="https://www.arangodb.com/" rel="nofollow">ArangoDB</a>和<a href="http://orientdb.com/" rel="nofollow">OrientDB</a> 。 尤其受关注的<a href="https://www.blazegraph.com/" rel="nofollow">Blazegraph</a>支持RDF和SPARQL。 </p><br><h2 id="ssylki"> 参考文献 </h2><br><ul><li>  <a href="https://neo4j.com/developer/cypher-query-language/" rel="nofollow">Neo4j：Cypher简介</a> </li><li>  <a href="https://neo4j.com/docs/cypher-refcard/current/" rel="nofollow">Neo4j Cypher Refcard</a> </li><li>  <a href="http://www.opencypher.org/" rel="nofollow">openCypher</a> </li></ul><br><h2 id="bibliografiya"> 参考书目 </h2><br><ul><li> 鲁滨逊·扬，韦伯·吉姆，埃弗雷姆·埃米尔。 图形数据库。 新功能 <br> 用于处理相关数据/ Per。 来自英语  -第二版  -M。：DMK-Press， <br>  2016-256秒 </li><li>  Bratko I.使用Prolog语言进行人工智能编程： <br> 反式 来自英语  -M .：米尔（Mir），1990年。-560羽。 </li></ul><br><h2 id="posleslovie"> 后记 </h2><br><p> 本文的作者仅知道两家公司（都来自圣彼得堡）在其产品中使用图形DBMS。 但是我想知道本文的读者中有多少家公司在开发过程中使用它们。 因此，我建议参加调查。 在评论中也写您的经历，这将非常有趣。 </p></div></div><p>Source: <a rel="nofollow" href="https://habr.com/ru/post/zh-CN482418/">https://habr.com/ru/post/zh-CN482418/</a></p>
<section class="more-articles-navigation-panel js-more-articles-navigation-panel">
<h4>More articles:</h4>
<nav class="list-of-articles-container js-list-of-articles-container"><ul class="list-of-pages js-list-of-pages">
<li><a href="../zh-CN482400/index.html">有趣的统计事实的选择＃2</a></li>
<li><a href="../zh-CN482404/index.html">助记符：探索增加大脑记忆的方法</a></li>
<li><a href="../zh-CN482406/index.html">顶级DLC现代科幻小说丛书</a></li>
<li><a href="../zh-CN482410/index.html">对巨大的分形相似的思考</a></li>
<li><a href="../zh-CN482416/index.html">我们用神经网络Porfirevich和巨魔爱丽丝替换了Google助手</a></li>
<li><a href="../zh-CN482420/index.html">JavaFX-还没死</a></li>
<li><a href="../zh-CN482426/index.html">VäterchenFrost或Habr的六位数</a></li>
<li><a href="../zh-CN482428/index.html">Dotnetru。 2019.结果</a></li>
<li><a href="../zh-CN482430/index.html">学习不是彩票，指标在撒谎</a></li>
<li><a href="../zh-CN482432/index.html">学校系统中的IT</a></li>
</ul></nav>
</section><br />
<a href="../../allArticles.html"><strong>All Articles</strong></a>
<script src="../../js/main.js"></script>

<!-- Yandex.Metrika counter -->
<script type="text/javascript" >
  (function (d, w, c) {
      (w[c] = w[c] || []).push(function() {
          try {
              w.yaCounter57283870 = new Ya.Metrika({
                  id:57283870,
                  clickmap:true,
                  trackLinks:true,
                  accurateTrackBounce:true,
                  webvisor:true
              });
          } catch(e) { }
      });

      var n = d.getElementsByTagName("script")[0],
          s = d.createElement("script"),
          f = function () { n.parentNode.insertBefore(s, n); };
      s.type = "text/javascript";
      s.async = true;
      s.src = "https://mc.yandex.ru/metrika/watch.js";

      if (w.opera == "[object Opera]") {
          d.addEventListener("DOMContentLoaded", f, false);
      } else { f(); }
  })(document, window, "yandex_metrika_callbacks");
</script>
<noscript><div><img src="https://mc.yandex.ru/watch/57283870" style="position:absolute; left:-9999px;" alt="" /></div></noscript>

<!-- Google Analytics -->
  <script>
    window.ga = function () { ga.q.push(arguments) }; ga.q = []; ga.l = +new Date;
    ga('create', 'UA-134228602-6', 'auto'); ga('send', 'pageview')
  </script>
  <script src="https://www.google-analytics.com/analytics.js" async defer></script>

</section>

<footer class="page-footer">
  <div class="page-footer-legal-info-container page-footer-element">
    <p>
      Weekly-Geekly ES | <span class="page-footer-legal-info-year js-page-footer-legal-info-year">2019</span>
    </p>
  </div>
  <div class="page-footer-counters-container page-footer-element">
    <a class="page-footer-counter-clustrmap" href='#'  title='Visit tracker'><img src='https://clustrmaps.com/map_v2.png?cl=698e5a&w=271&t=t&d=9uU9J9pq8z7k8xEBHYSfs6DenIBAHs3vLIHcPIJW9d0&co=3a3a3a&ct=ffffff'/></a>
  </div>
</footer>
  
</body>

</html>